{
    "AY2023/24 Semester 1": {
        "CS1231S Discrete Structures": [
            "His teaching is really engaging, and he often takes an extra step to make tutorial a meaningful and enjoyable journey",
            "Great tutor who explains concepts well!",
            "He is good in teaching the course to the class and very patient",
            "Instant reply for questions we're facing. Concepts were taught in an efficient and easy to understand way",
            "He is very fluent and clear in his delivery of knowledge, and always able to provide feedbacks and advices on anything regardless of academics and non-academics stuff. I appreciate his effort to make CS1231S a insightful course for us, as well as the effort to pave the path of the future for us.",
            "Short and sweet",
            "Great tutor who spends extra time and effort to ensure everyone understands concepts",
            "He can explain the information well and he also always willing to answer the students doubts when we ask questions",
            "He was able to explain the answers to the tutorial clearly",
            "Takes time to answer and addres any doubts that the class might have"
        ],
        "TIC2001 Data Structures and Algorithms": [
            "I think he is a really good TA who understands Data Structure and Algorithm well.",
            "Yes",
            "He really understands algorithm and is able to explain his thoughts clearly.",
            "Knows how to explain difficult topics",
            "Patient and gives you hints on the issues you might have rather than spoonfeed you with answers, allowing you to learn on your own.",
            "He is knowledgeable"
        ]
    },
    "AY2023/24 Semester 2": {
        "CS1231S Discrete Structures": [
            "He takes time outside of tutorial hours to help me understand topics. He's also very responsive when I ask him questions on telegram.",
            "He provides valuable feedback on our solutions and questions, suggesting ways in which we can improve on our answers. Not only does he care for our abilities within the course, but he also helps us with general tips , such as how to continue with our university goals further into the years.",
            "He explains well.",
            "Super passionate and good at teaching",
            "good TA",
            "patient, gracious TA that goes out of the way to help others! really knows his content well and gives very comprehensive answers to questions.",
            "He caters his explanation to everyone's pace and ability. I find him very patient when teaching.",
            "He understands the capabilities of the students. He will quickly go through questions that we do not have problems on and focus more on those we have difficulties on.",
            "Explnanation",
            "Passionate and knowledgeable",
            "very patient + knows his content well and answers me readily whenever i have questions!! took the time to meet me for consultations despite having classes almost back to back",
            "He provides very useful advices on how to prove certain questions:\n- How to think through\n- What concepts to grasp in order to prove",
            "The weekly tutorial recap was very useful for our learning.",
            "Please continue TA-ing"
        ],
        "CS2040S Data Structures and Algorithms": [
            "Y1S2 best TA for me",
            "Very helpful.",
            "Absolutely! He puts so much effort to help and guide us through the journey of 2040s. He explains the concepts really well and really passionate to answer our question regarding the algorithm being taught in class. I would definitely say he is the best TA I encounter in my university life!",
            "He consistently demonstrates thorough preparation and genuine concern for his students' learning journey. His explanations are clear and effective, making complex concepts easily understandable.",
            "very patient at explaining abstract concepts, he spares out his time after classes to answer our questions and clears our doubts about this course. without him i cannot survive this mod",
            "Chin Herng motivates me to put in my best effort for cs2040s. He encourages us to do our best both academically and to also take required breaks for good mental health. He provides us with useful feedback on our problem sets and explains the concepts taught in class very well.",
            "Explains very clearly, points out the key points students will need to remember, fast responses, and able to explain topics that I find hard to understand",
            "Explains the concepts from the lecture very well before starting questions.",
            "When asking the TA personally, provides great tutoring skills for me to think, understand and solve problems.",
            "teaching",
            "He responds to our queries in a timely manner and explains complicated concepts in an easy to understand manner",
            "He's patient in understanding our confusion and misconception to help us. He also explains the underlying concept in 2040s in an easy to understand and detailed manner that really helps me a lot. I think he helps me build a strong fundamental for 2040s especially in both the abstract concept and also how can I implement the solution with his advice on ways to improve my problem set.",
            "very helpful, explains concepts very well",
            "very patient at explaining abstract concepts",
            "Recap sessions were useful. Really good explanations on the concepts in the tutorial sheet",
            "too good"
        ]
    },
    "AY2024/25 Semester 1": {
        "CS1231S Discrete Structures": [
            "He goes out of his way to ensure that not only can we do the tutorials, but also that we actually understand the mechanics of the underlying subject matters.",
            "he cares for those he teaches",
            "He is able to convey the important takeaways from each chapter in the course during tutorials, making it easier for students in his class to know what the tutorial is testing us on. Care for students",
            "Best ta",
            "just love his teaching style and i really want to express my gratitude to him!!!!! you really helped me a lot!!!",
            "He is able to demystify the complex subject of CS1231S to make it much simpler to understand and do it in a fun and engaging way.",
            "Very knowledgeable about the subject and very approachable and friendly. Cares for our learning, very willing to answer our questions and clarify out doubts",
            "He cares for students' well-being and academic progress, and constantly provides support and room for further discussion while ensuring that the less adept students are keeping up.",
            "His passion for teaching CS1231S is unmistakable, and his dedication to making every lesson engaging and impactful sets him apart as an extraordinary educator. He takes immense pride in what he teaches, ensuring that even the most challenging concepts are conveyed in a captivating and accessible manner. He also goes beyond the scope of standard tutorial materials by introducing intuitive and creative methods to solve problems. His approach encourages students to think critically and develop a deeper understanding of the subject. His commitment to this goes beyond the classroom, as he is always willing to engage in thoughtful discussions and provide clear explanations to questions outside of tutorial time slots. His responsiveness and supportiveness make him an invaluable mentor. His genuine care for his students' success is evident in the effort he puts into ensuring we grasp the material and feel confident in our abilities. His teaching not only helps students excel academically but also fosters a lasting appreciation for the subject.",
            "Very passionate and knowledgeable",
            "nice fun cute",
            "Very knowledgeable and able to explain the various complex topics in a simplified manner that helps me to really understand whats going on. Additionally, he is readily available for consults and also gives detailed explanation as to why my answer is wrong, which helps me to learn and progress a lot.",
            "His passion for theoretical computer science is shown through his teaching. He cares about not only the students in his tutorial groups but helps to answer questions asked by other students taking the same module in the group chat.",
            "He puts in a great amount of effort, not only in his tutorials, but also outside tutorial responding to us in the groupchat when asking about alternate proofs or clarifying understanding of certain topics",
            "he is able to explain and break down difficult concepts into smaller and understandable parts. he answers every question raised to his best ability",
            "Very engaging and explains concepts well",
            "He is extremely clear about the course content, with easy to understand explanations.",
            "He is able to convey the important takeaways from each chapter in the course during tutorials, making it easier for students in his class to know what the tutorial is testing us on",
            "He is able to simplify abstract topics by relating them to topics we are already familiar with.",
            "he is very patient and good at explaining abstract concepts to students",
            "He doesnt just explain the answers to questions, but explains the process of getting the answer so that we may apply it to other questions as well",
            "Clarity when covering content and attempts to involve everyone in the class",
            "He is knowledgeable and can explain his thinking process very well.",
            "He is very understanding, chill, and likeable. His explanation is also very easy to understand",
            "Very knowledgeable about the subject and very approachable and friendly. Cares for our learning.",
            "Well-knowledged, able to answer students' doubts",
            "He is experienced and enthusiastic teaching assistant, who always tries to make the class engaging and clearly explains concepts.",
            "He often stresses the importance of developing strong intuition alongside rigour, and strives to look for creative and intuitive solutions to tutorial questions. His teachings and materials are often clear and concise, his strong mastery of the subject allows quick and frequent discussions and feedback.",
            "very knowledgable about the subject and approachable when i need help or i am in doubt, his explanations are succinct and help me to understand the subject better",
            "Good explanations",
            "He is extremely interested in CS1231S, taking pride in what he is teaching, making every lesson captivating. He furthers this strength by looking outside of the content that is provided by the tutorials, teaching us intuitive methods to solve tutorial questions. Past the tutorial time slots, he is also very responsive to questions that i ask him when i am unsure.",
            "He explains hard concepts very well and is also very patient in guiding us through.",
            "Very knowledgeable",
            "He has a strong understanding of the concepts and problems, which makes it engaging to listen to and easier to remember.",
            "Chin Herng is really very good at explaining the various topics, helping me to fully understand the concepts and how to use the various theorems to answer questions. He is also readily available to answer any queries or questions online and he goes into detail when answer my questions, helping me to comprehend where I have gone wrong. As such, I am always learning more from the tutorials compared to the lectures, simply because Chin Herng is really good at teaching.",
            "He is very familiar and well versed with the content he is teaching. His tutorial sessions are never dull or boring and he makes complicated concepts easier to understand and digest. If possible I would like to bid for his tutorial slot for CS2040S next semester.",
            "good at explaining, willing to adjust teaching to meet student needs"
        ],
        "CS2040S Data Structures and Algorithms": [
            "best ta of all time that goes the extra mile for students, cares about their wellbeing and puts others first before himself",
            "Cares about student learning and development",
            "His teaching and support helps a lot not only in academics.",
            "Responds very fast and outside of working hours",
            "TA Chin Herng provided timely responses to my questions, even outside of CS2040S (help with understanding solutions to OA questions about topics such as divide and conquer, dynamic programming). He is also passionate and definitely knowledgeable about theoretical computer science, and DSA. He is approachable and i think he put a lot of thought into how to structure his labs and help us understand each topic. Despite his likely also buys schedule, he goes out of his way to provide explanations and examples, further than what was asked, showing his care for student's development and learning.",
            "cares about students wellbeing and gives good advice + goes the extra mile",
            "Cares about student development and learning.",
            "Friendly and approachable, provided valuable feedback for debugging",
            "Helpful and patient, willing to help his students"
        ]
    },
    "AY2024/25 Semester 2": {
        "CS1231S Discrete Structures": [
            "Can explain concepts very well. Always make the class learning environment very engaging. A very patient and helpful TA who always help students to clarify doubts.",
            "He deserve it through his high standard teaching style and quality.",
            "The best tutor in teaching and supporting me.",
            "He is very engaging during tutorials and is willing to clarify any doubts we have regarding any concepts. Very patient as well cuz whenever i text him for questions he will give timely and detailed replies. Overall a very very dedicated TA and i highly recomment nominating him for teaching awards",
            "This guy is still exceptional in the way he break the content down for us",
            "I thought he knew his way around the subject well, especially for something so unique where students can ask anything logical and you must be super well-versed with the content to be able to do it well.",
            "He knows what is going on and can tell that he is a seasoned TA. He would be ready to answer questions and set up consultations for students struggling",
            "i think that he is always open to explaining the tutorials more in depth when asked",
            "Chin Herng is very supportive to provide insightful comments on how to solve hard problems easily with clear explaination of the logic behind his explaination. I can learn the concepts fast through his clear and patient explaination.\n\nMorever, he is helpful and kind to provide extra consultation even though it is midterm period. Thanks for his consultation, I can learn discrete math much easier.",
            "He breaks down concepts clearly and explains the intuition behind the mathematical proofs. He also brought bubble tea for us!",
            "He breaks down the basics and reminds us of terms from previous chapter to teach us future contents",
            "He's able to help us connect the theory that we learn in lecture to the tutorial questions that we go through in tutorial classes. He's also willing to help us understand the issues that we may have, especially from quiz questions and also generally, our understanding of this module.",
            "My DM GOAT lolol. Honestly, teaches really well, gives interesting insights.",
            "He can explain the questions very clearly and is willing to share all his experience and insights with me, which helped me in learning CS1231S. He welcomed my consultations every time and tried his best to help me out, even though it may take hours away from him. I appreciate his kindness and support!"
        ],
        "CS2040S Data Structures and Algorithms": [
            "dedicated in teaching the subject, tries his best to help us understand. he also prepares for the lesson sufficiently through his own slides/ notes",
            "he is patient and understanding and guides you through solving the problem sets by providing you clues on why your approach might not be feasible without directly providing you the answer",
            "He explained each given question in detail.",
            "He takes extra time to look at our problem sets and really find out if there are any areas that we could improve in. His tutorials are concise and easy to follow. He has a good understanding of the content and is always prepared for tutorials.",
            "I could tell that he's extremely passionate about teaching right from the first tutorial! He's also extremely clear with his explanations, skipping basic concepts while spending sufficient time breaking down more complex ideas and the thought process behind how to devise various algos :) Overall super duper chill and friendly ta that I can approach if I have any doubts! I'm not the biggest fan of 2040s but he really makes it a lot more enjoyable yay",
            "Very Knowledgeable and takes the time to explain and go indepth on the topics, very friendly and approachable",
            "he guides you to get to the answer without outright saying it so that u can try to apply the concepts you have learnt and that has helped me gain a deeper understanding of the concepts",
            "Looking at code submissions and pointing out the flaws, even if the program passes all test cases.",
            "extremely clear with his explanations and clearly has an amazing grasp of the concepts he is teaching",
            "Really good teacher, helpful with answering questions outside class as well",
            "very helpful and inspiring"
        ]
    },
    "AY2025/26 Semester 1": {
        "CS1231S Discrete Structures": [
            "He is a really great tutor and really dedicated, he always makes sure we understand the material. He also would prepare useful recaps and notes for us to further understand the material.",
            "Besides his outstanding teaching skill, he showed extra care to us in particular about handling exam stress and post-exam support.",
            "He is engaging and truly cares for the understanding of students in his tutorial group. He is also willing to spend time outside of tutorial to explain concepts and provide help to students when needed",
            "explain everything claerly",
            "He is a good tutor overall",
            "He is one of the best teachers i've ever met, he always seem so eager to impart his knowledge to us and he explains concepts really well. Whenever i have a problem or query, he would try his best to explain it to us to the best of his ability.",
            "Generous and caring tutor",
            "He is very patient, teaches us to think critically by focussing on the thought process and often gives very insightful feedbacks! He provides very useful extra learning materials such as notes too!",
            "genuinely interested in the course material and content. great teaching abilities, can communicate ideas and clear doubts effectively, provides timely feedback and responses.",
            "He is very helpful and the way he explains the material is very clear and easy to understand. He would also make some written recaps for us to review the material, I think he has a very strong dedication in teaching us.",
            "He is able to explain in depth about certain abstract topics such as cardinality and has a good understanding of the topics taught in 1231S, and is very willing to do consultations to help clear doubts about topics",
            "provided effective and concise recap of the lecture material before starting on tutorial questions and very approachable",
            "He made extra efforts to create recaps of tutorial questions. Besides, he also made sure all his tutorial group students understood the materials. He is very open to any consultation to improve our understanding about CS1231S materials.",
            "He is able to break down the difficult concepts by using simple examples and visuals to enhance our learning. He is also succinct in his feedback to tutorial answers and gives clear reasoning as to why a method still works or does not apply.",
            "he is very knowledgeable about the subject and is very encouraging, willing to answer questions and explain concepts",
            "His explanation on the tutorial questions",
            "Being open minded",
            "He is one of the best teachers i've ever met, he always seem so eager to impart his knowledge to us and he explains concepts really well. Whenever i have a problem or query, he would try his best to explain it to us to the best of his ability.",
            "Generous tutor. Willing to give consults whenever i require. Takes the time to teach",
            "teaching ability",
            "Very helpful and responsive!",
            "meticulous. the 2 hour tutorial sessions felt very content heavy and very long. respect to his dedication to communicate the tutorial materials effectively and going through each point"
        ],
        "CS2040S Data Structures and Algorithms": [
            "very helpful and responsive. very passionate too",
            "He is a great TA.",
            "He can explain the data structures very well with the related examples of problems. Also, is a very patient TA, encourage students to ask questions.",
            "really effective tutor",
            "He is truly a very caring teaching assistant and he truly cares about whether his students understand him",
            "He has very clear and deep understanding of the concepts taught, and hence he is able to guide us through each algorithm. I even bid for his slot as he taught me in CS1231S once and that one tutorial session is enough for me to know that he has the capability to teach and enhance our knowledge.",
            "Chin Herng was a really good TA, and he had a very good grasp of the concepts, which translated into his lessons because they were all very clear and easy to understand. He also would often go the extra mile to check in on students who might be struggling or need extra assistance with any submissions.",
            "He is a very patient TA, and will go to great lengths to make sure his students understand the concept.",
            "Chin Herng comes to every lesson well-prepared. He breaks down difficult concepts well, answers students' questions with clarity and ease. I can tell he's really passionate about teaching! He's also really smart.",
            "His is the \"GOAT\"! The best tutor I have ever met! He explains concept very clear and can always answer all of our questions. Whenever I have question and text him through telegram, he will always reply timely. His teaching is fantastic!",
            "He is a very committed TA and ensures all of his students can understand his tutorial. He motivates all students and gives very helpful tips before examinations to help his students score better. Most importantly, he explains concepts extremely well.",
            "very attentive and helpful, takes time to reexaplain concepts and explore other solutions suggested by students",
            "He has the drive to teach and can vibe well with students.",
            "Supportive and very mature in teaching",
            "methadalogical in teaching",
            "He is very patient and is very good at explaining difficult concepts. More importantly, he is very present and is super responsive in answering questions.",
            "He explained each concepts quite clearly (even to someone without reading the lecture in advance), I could roughly understand.",
            "good at explaining",
            "He was very clear in his explanations, be it during the lab itself or in any questions answered prior to or after\n\nHe made the different algorithms and topics a lot more digestable and easier to understand through his explanations/illustrations through the slides",
            "He is able to explain difficult concepts in simple terms. This aid me in understanding the concept better",
            "Explains difficult concepts in a way that is very easy to understand. HES THE GOAT",
            "The best tutor I have ever met! He explains concept very clear and can always answer all of our questions. Whenever I have question and text him through telegram, he will always reply timely. His teaching is fantastic!",
            "Able to explain concepts very clearly. Provides very helpful tips for tests. Very responsive to telegram and discord questions.",
            "Explains concepts in a way that is easy to understand",
            "Very knowledgeable, approachable, helpful, responsive, and just so wonderful.",
            "Chin Herng knows his stuff very well, and is able to put it in a way where we can understand the topic better. He is a good TA."
        ]
    }
}
